Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: This allows you to customize how the value appears in GoogleTest's output without affecting code that relies on the behavior of `AbslStringify()`.
it_it: Ciò consente di personalizzare il modo in cui il valore appare nell'output di GoogleTest senza influenzare il codice che si basa sul comportamento di `AbslStringify()`.

source: This allows you to easily check what drawing primitives your program is calling, with what arguments, and in which order.
it_it: Ciò consente di controllare facilmente quali primitive di disegno sta chiamando il programma, con quali argomenti e in quale ordine.

source: This allows you to reuse the same configuration of objects for several different tests.
it_it: Questa consente di riutilizzare la stessa configurazione di oggetti per più test.

source: This also works when the argument is an output iterator:
it_it: Funziona anche quando l'argomento è un iteratore di output:

source: This article introduces readers to some of the more useful features of the Google C++ Testing Framework and is based on version 1.4 of the release.
it_it: Questo articolo presenta ai lettori alcune delle funzionalità più utili di Google C++ Testing Framework ed è basato sulla versione 1.4.

source: This article just scratches the surface of the Google C++ Testing Framework.
it_it: Questo articolo graffia solo la superficie del Google C++ Testing Framework.

source: This can be // used with WillOnce, but the compiler will reject it if handed to // WillRepeatedly.
it_it: Può essere // utilizzato con WillOnce, ma il compilatore lo rifiuterà se passato a // WillRepeatedly.

source: This can be a major source of frustration.
it_it: Questa può essere uno dei principali motivi di frustrazione.

source: This can be useful when composing matchers.
it_it: Questo può essere utile quando si compongono i matcher.

source: This class contains information about the test program.
it_it: Questa classe contiene informazioni sul programma di test.

source: This common pattern is easy to recognize and makes tests easy to maintain.
it_it: Questo schema comune è facile da riconoscere e semplifica la manutenzione dei test.

source: This concern is totally understandable.
it_it: Questa preoccupazione è del tutto comprensibile.

source: This contradicts with the requirement to run BarTest.DefDeathTest before FooTest.Uvw.
it_it: Ciò è in contraddizione con l'obbligo di eseguire BarTest.DefDeathTest prima di FooTest.Uvw.

source: This contradicts with the requirement to run `BarTest.DefDeathTest` before `FooTest.Uvw`.
it_it: Ciò è in contraddizione con l'obbligo di eseguire `BarTest.DefDeathTest` prima di `FooTest.Uvw`.

source: This difference could be either intentional (as in simulating an error such that you can test the error handling code) or unintentional.
it_it: Questa differenza potrebbe essere intenzionale (come nella simulazione di un errore in modo da poter testare il codice di gestione degli errori) o involontaria.

source: This document will show you more assertions as well as how to construct complex failure messages, propagate fatal failures, reuse and speed up your test fixtures, and use various flags with your tests.
it_it: Questo documento illustrerà altre asserzioni e come costruire messaggi di errore complessi, propagare errori fatali, riutilizzare e velocizzare fixture e utilizzare vari flag con i test.

source: This example shows that **expectations in gMock are "sticky" by default**, in the sense that they remain active even after we have reached their invocation upper bounds.
it_it: Questo esempio mostra che **le expectation in gMock sono per default "appiccicose"**, nel senso che rimangono attive anche dopo aver raggiunto i limiti superiori della loro invocazione.

source: This example shows that expectations in gMock are "sticky" by default, in the sense that they remain active even after we have reached their invocation upper bounds.
it_it: Questo esempio mostra che le expectation in gMock sono per default "appiccicose", nel senso che rimangono attive anche dopo aver raggiunto i limiti superiori della loro invocazione.

source: This feature is easy to abuse, so please exercise your good sense when doing it!
it_it: È facile abusare di questa funzione, quindi è meglio usare il buon senso!

source: This feature is enabled only if the TEST_PREMATURE_EXIT_FILE environment variable has been set.
it_it: Questa funzione è abilitata solo se è stata impostata la variabile di ambiente TEST_PREMATURE_EXIT_FILE.

source: This feature is enabled only if the `TEST_PREMATURE_EXIT_FILE` environment variable has been set.
it_it: Questa funzione è abilitata solo se è stata impostata la variabile di ambiente `TEST_PREMATURE_EXIT_FILE`.

source: This flag lets gMock print a trace of every mock function call it receives.
it_it: Questo flag consente a gMock di stampare un trace per ogni chiamata di funzione mock che riceve.

source: This function was formerly a macro; thus, it is in the global namespace and has an all-caps name.
it_it: Questa funzione in precedenza era una macro; quindi, si trova nel namespace globale e ha un nome tutto in maiuscolo.

source: This functionality is only available when a method is not overloaded; to prevent unexpected behavior it is a compilation error to try to set an expectation on a method where the specific overload is ambiguous.
it_it: Questa funzionalità è disponibile solo quando un metodo non è overloaded; per evitare comportamenti imprevisti, tentare di impostare un'aspettativa [expectation] su un metodo in cui l'overload specifico è ambiguo costituisce un errore di compilazione.

source: This gives you the best of both worlds.
it_it: Questo fornisce il meglio di entrambi i mondi.

source: This has the problem of not showing you the values of the parts of the expression, making it hard to understand what went wrong.
it_it: Questo ha il problema di non mostrare i valori delle parti dell'espressione, rendendo difficile capire cosa è andato storto.

source: This helps to reveal bad dependencies between tests.
it_it: Questo aiuta a rivelare delle cattive dipendenze tra i test.

source: This implementation class does *not* need to inherit from any particular class.
it_it: Questa classe di implementazione *non* ha bisogno di ereditare da una classe particolare.

source: This implementation class does not need to inherit from any particular class.
it_it: Questa classe di implementazione non ha bisogno di ereditare da una classe particolare.

source: This instance is never deleted.
it_it: Questa istanza non viene mai eliminata.

source: This interface defines the type alias ParamType for the parameter type T and has support for accessing the test parameter value via the GetParam() method:
it_it: Questa interfaccia definisce l'alias del tipo ParamType per il tipo di parametro T e supporta l'accesso al valore del parametro di test tramite il metodo GetParam():

source: This interface defines the type alias `ParamType` for the parameter type `T` and has support for accessing the test parameter value via the `GetParam()` method:
it_it: Questa interfaccia definisce l'alias del tipo `ParamType` per il tipo di parametro `T` e supporta l'accesso al valore del parametro di test tramite il metodo `GetParam()`:

source: This is better than commenting out the code or using #if 0, as disabled tests are still compiled (and thus won't rot).
it_it: Questo è meglio che commentare il codice o usare #if 0, poiché i test disabilitati vengono comunque compilati (e quindi non "marciranno").

source: This is gMock's (and jMock's) fundamental philosophy: it's easy to accidentally over-specify your tests, and we want to make it harder to do so.
it_it: Questa è la filosofia fondamentale di gMock (e di jMock): è facile sovra-specificare accidentalmente i test e noi vogliamo rendere più difficile farlo.

source: This is sometimes called "state-based testing".
it_it: Questo è talvolta chiamato "test basato sullo stato".

source: This is **wrong and dangerous**.
it_it: Questo è **sbagliato e pericoloso**.

source: This is wrong and dangerous.
it_it: Questo è sbagliato e pericoloso.

source: This is a MSVC bug.
it_it: Questo è un bug di MSVC.

source: This is a consequence of Google's not using exceptions.
it_it: Questa è una conseguenza del fatto che Google non utilizza le eccezioni.

source: This is all good, except that you need to know the type of the function in which the action will be used.
it_it: Va tutto bene, tranne che è necessario conoscere il tipo della funzione in cui verrà utilizzata l'azione.

source: This is an advanced API only to be used when the TEST macros are insufficient.
it_it: Questa è un'API avanzata da utilizzare solo quando le macro TEST sono insufficienti.

source: This is an advanced API only to be used when the `TEST` macros are insufficient.
it_it: Questa è un'API avanzata da utilizzare solo quando le macro `TEST` sono insufficienti.

source: This is an important rule to remember, as it affects the meaning of the spec, and is different to how it's done in many other mocking frameworks (Why'd we do that?
it_it: Questa è una regola importante da ricordare, poiché influenza il significato delle specifiche ed è diversa da come viene eseguita in molti altri framework di simulazione (Perché dovremmo farlo?

source: This is an important rule to remember, as it affects the meaning of the spec, and is **different** to how it's done in many other mocking frameworks (Why'd we do that?
it_it: Questa è una regola importante da ricordare, poiché influenza il significato delle specifiche ed è **diversa** da come viene eseguita in molti altri framework di simulazione (Perché dovremmo farlo?

source: This is basically what we've told you in the Using Multiple Expectations section above.
it_it: Questo è fondamentalmente ciò che abbiamo detto nella sezione Uso di Expectation Multiple sopra.

source: This is basically what we've told you in the [Using Multiple Expectations](#MultiExpectations) section above.
it_it: Questo è fondamentalmente ciò che abbiamo detto nella sezione [Uso di Expectation Multiple](#MultiExpectations) sopra.

source: This is because calling a virtual method before the derived class constructor has a chance to run is very dangerous - the virtual method might operate on uninitialized data.
it_it: Questo perché chiamare un metodo virtuale prima che il costruttore della classe derivata abbia la possibilità di essere eseguito è molto pericoloso: il metodo virtuale potrebbe operare su dati non inizializzati.

source: This is better than commenting out the code or using `#if 0`, as disabled tests are still compiled (and thus won't rot).
it_it: Questo è meglio che commentare il codice o usare `#if 0`, poiché i test disabilitati vengono comunque compilati (e quindi non "marciranno").

source: This is called "naggy" behavior; to change, see The Nice, the Strict, and the Naggy.
it_it: Questo comportamento è detto "naggy" (fastidioso); per modificarlo, vedere Nice, Strict e Naggy.

source: This is called "naggy" behavior; to change, see [The Nice, the Strict, and the Naggy](gmock_cook_book.md#NiceStrictNaggy).
it_it: Questo comportamento è detto "naggy" (fastidioso); per modificarlo, vedere [Nice, Strict e Naggy](gmock_cook_book.md#NiceStrictNaggy).

source: This is checked at runtime.
it_it: Questo viene controllato in fase di esecuzione.

source: This is convenient as it leaves you with one less thing to worry about.
it_it: Questo è conveniente perché lascia con una cosa in meno di cui preoccuparsi.

source: This is easy in gMock.
it_it: Questo è facile in gMock.

source: This is especially handy when the argument is a temporary value:
it_it: Ciò è particolarmente utile quando l'argomento è un valore temporaneo:

source: This is fine when the interface being mocked (say, Foo) is owned by the same person or team.
it_it: Questo va bene quando l'interfaccia mock-ata (ad esempio, Foo) è di proprietà della stessa persona o team.

source: This is fine when the interface being mocked (say, `Foo`) is owned by the same person or team.
it_it: Questo va bene quando l'interfaccia mock-ata (ad esempio, `Foo`) è di proprietà della stessa persona o team.

source: This is in sharp contrast to frameworks such as CppUnit.
it_it: Ciò è in netto contrasto con framework come CppUnit.

source: This is mainly useful inside template code.
it_it: Ciò è utile principalmente all'interno del codice template.

source: This is not necessary for methods that are not mentioned at all (these are "uninteresting"), but is useful for methods that have some expectations, but for which other calls are ok.
it_it: Ciò non è necessario per i metodi non menzionati (questi sono "poco interessanti"), ma è utile per i metodi che hanno alcune expectation, ma per i quali vanno bene altre chiamate.

source: This is often more effective and economical to do than state-based testing.
it_it: Questo è spesso più efficace ed economico rispetto ai test state-based.

source: This is the default.
it_it: Questo è il default.

source: This is the preferred syntax in the style guide because nullptr does not have the type problems that NULL does.
it_it: Questa è la sintassi preferita nella guida stilistica perché nullptr non presenta i problemi sul tipo che presenta NULL.

source: This is the preferred syntax in the style guide because `nullptr` does not have the type problems that `NULL` does.
it_it: Questa è la sintassi preferita nella guida stilistica perché `nullptr` non presenta i problemi sul tipo che presenta `NULL`.

source: This is the sum of the number of successful test parts and the number of failed test parts.
it_it: Questa è la somma del numero di parti di test riuscite e di quelle fallite.

source: This is typical of problems related to memory corruption.
it_it: Questo è tipico dei problemi legati alla corruzione della memoria.

source: This is useful if many test suites have something in common.
it_it: Ciò è utile se molte test suite hanno qualcosa in comune.

source: This is useful in a number of situations, for example:
it_it: Ciò è utile in diverse situazioni, ad esempio:

source: This is useful when you need to check for preconditions of the system under test during runtime and skip tests in a meaningful way.
it_it: Ciò è utile quando si devono verificare le precondizioni del sistema sotto test durante il runtime e saltare i test in modo significativo.

source: This is where fixtures come in—they help you set up such custom testing needs.
it_it: È qui che entrano in gioco le fixture: aiutano a impostare tali esigenze di test personalizzate.

source: This isn't mandatory.
it_it: Questo non è obbligatorio.

source: This lets you provide a more readable error message in case of failure and avoid all of the issues described below.
it_it: Ciò consente di fornire un messaggio di errore più leggibile in caso di errore ed evitare tutti i problemi descritti di seguito.

source: This listener should be added after other listeners if you have any, otherwise they won't see failed OnTestPartResult.
it_it: Questo listener deve essere aggiunto dopo gli altri listener, se ce ne sono, altrimenti non vedranno OnTestPartResult fallire.

source: This listener should be added after other listeners if you have any, otherwise they won't see failed `OnTestPartResult`.
it_it: Questo listener deve essere aggiunto dopo gli altri listener, se ce ne sono, altrimenti non vedranno `OnTestPartResult` fallire.

source: This makes my_mock.IsDirty() return true before my_mock.Flush() is called and return false afterwards.
it_it: Questo fa sì che my_mock.IsDirty() restituisca true prima che my_mock.Flush() venga chiamato e restituisca false successivamente.

source: This makes `my_mock.IsDirty()` return `true` before `my_mock.Flush()` is called and return `false` afterwards.
it_it: Questo fa sì che `my_mock.IsDirty()` restituisca `true` prima che `my_mock.Flush()` venga chiamato e restituisca `false` successivamente.

source: This makes any calls to the method expected.
it_it: Ciò rende expected tutte le chiamate al metodo.

source: This makes debugging much easier.
it_it: Ciò semplifica molto il debug.

source: This makes it difficult to keep side effects from escaping one test and contaminating others, making debugging difficult.
it_it: Ciò rende difficile evitare che gli effetti collaterali sfuggano a un test e contaminino gli altri, rendendo difficile il debug.

source: This makes the definition less cluttered and less fragile in case the types of the uninteresting arguments change.
it_it: Ciò rende la definizione meno confusa e meno fragile nel caso in cui cambino i tipi di argomenti poco interessanti.

source: This makes your test easy to follow.
it_it: Ciò facilita il test da eseguire.

source: This matching order allows you to set up the common behavior in a mock object's constructor or the test fixture's set-up phase and specialize the mock's behavior later.
it_it: Questo ordine di corrispondenza consente di impostare il comportamento comune nel costruttore di un oggetto mock o nella fase di impostazione della fixture e di specializzare il comportamento del mock in seguito.

source: This maximizes the coverage of a test run.
it_it: Ciò massimizza la copertura di un'esecuzione di test.

source: This may be counter-intuitive.
it_it: Questo potrebbe essere controintuitivo.

source: This may not be what you want.
it_it: Questo potrebbe non essere quello che si vuole.

source: This may seem like a lot of hassle, but in practice you often have multiple related functions that you can put in the same interface, so the per-function syntactic overhead will be much lower.
it_it: Potrebbe sembrare una seccatura, ma in pratica spesso ci sono più funzioni correlate inseribili nella stessa interfaccia, quindi la complicazione sintattica per ogni funzione sarà molto inferiore.

source: This means that the execution of action1 and action2 in the above example may interleave.
it_it: Ciò significa che l'esecuzione di action1 e di action2 nell'esempio precedente può interlacciarsi.

source: This means EXPECT_CALL() should be read as expecting that a call will occur in the future, not that a call has occurred.
it_it: Ciò significa che EXPECT_CALL() dovrebbe essere letto come se si aspettasse che una chiamata avverrà in futuro, non che una chiamata sia avvenuta.

source: This means `EXPECT_CALL()` should be read as expecting that a call will occur *in the future*, not that a call has occurred.
it_it: Ciò significa che `EXPECT_CALL()` dovrebbe essere letto come se si aspettasse che una chiamata avverrà *in futuro*, non che una chiamata sia avvenuta.

source: This means only one test suite can use a particular fixture.
it_it: Ciò significa che solo una test suite può utilizzare una particolare fixture.

source: This means that A must occur before B and C, and C must occur before D. There's no restriction about the order other than these.
it_it: Ciò significa che A deve verificarsi prima di B e C, e C deve verificarsi prima di D. Non ci sono restrizioni sull'ordine diverso da questi.

source: This means that the execution of `action1` and `action2` in the above example *may* interleave.
it_it: Ciò significa che l'esecuzione di `action1` e di `action2` nell'esempio precedente *può* interlacciarsi.

source: This means that the following is **allowed** because both tests use the same fixture class (`::testing::Test`).
it_it: Ciò significa che quanto segue è **consentito** poiché entrambi i test utilizzano la stessa classe fixture (`::testing::Test`).

source: This means that the following is allowed because both tests use the same fixture class (::testing::Test).
it_it: Ciò significa che quanto segue è consentito poiché entrambi i test utilizzano la stessa classe fixture (::testing::Test).

source: This means using the template meta programming tricks twice in the implementation, making it even harder to understand and maintain.
it_it: Ciò significa utilizzare i trucchi della metaprogrammazione del template due volte nell'implementazione, rendendolo ancora più difficile da comprendere e mantenere.

source: This method template takes the mock function's arguments as a tuple in a single argument, and returns the result of the action.
it_it: Questo metodo template accetta gli argomenti della funzione mock come una tupla in un argomento singolo e restituisce il risultato dell'azione.

source: This method template takes the mock function's arguments as a tuple in a **single** argument, and returns the result of the action.
it_it: Questo metodo template accetta gli argomenti della funzione mock come una tupla in un argomento **singolo** e restituisce il risultato dell'azione.

source: This method's argument list is lengthy and hard to work with (the message argument is not even 0-terminated).
it_it: L'elenco degli argomenti di questo metodo è lungo e difficile da gestire (l'argomento message non è nemmeno "0-terminated").

source: This method's argument list is lengthy and hard to work with (the `message` argument is not even 0-terminated).
it_it: L'elenco degli argomenti di questo metodo è lungo e difficile da gestire (l'argomento `message` non è nemmeno "0-terminated").

source: This must be called before calling RUN_ALL_TESTS().
it_it: Deve essere chiamato prima di chiamare RUN_ALL_TESTS().

source: This must be called before calling [`RUN_ALL_TESTS()`](#RUN_ALL_TESTS).
it_it: Deve essere chiamato prima di chiamare [`RUN_ALL_TESTS()`](#RUN_ALL_TESTS).

source: This number can be used as a metric for improving your test quality.
it_it: Questo numero può essere utilizzato come parametro per migliorare la qualità del test.

source: This page lists the assertion macros provided by GoogleTest for verifying code behavior.
it_it: Questa pagina elenca le macro di asserzione fornite da GoogleTest per verificare il comportamento del codice.

source: This page lists the built-in actions provided by GoogleTest.
it_it: Questa pagina elenca le azioni native di GoogleTest.

source: This page lists the facilities provided by GoogleTest for creating and working with mock objects.
it_it: Questa pagina elenca le funzionalità fornite da GoogleTest per creare e lavorare con oggetti mock.

source: This page lists the facilities provided by GoogleTest for writing test programs.
it_it: Questa pagina elenca le funzionalità fornite da GoogleTest per scrivere programmi di test.

source: This pattern is also useful when the arguments are interesting, but match logic is substantially complex.
it_it: Questo pattern è utile anche quando gli argomenti sono interessanti, ma la logica della corrispondenza [match] è sostanzialmente complessa.

source: This pattern is known as *abstract tests*.
it_it: Questo pattern è detto *test astratti* [abstract tests].

source: This pattern is known as abstract tests.
it_it: Questo pattern è chiamato test astratti.

source: This printer knows how to print built-in C++ types, native arrays, STL containers, and any type that supports the << operator.
it_it: Questa stampante sa come stampare i tipi nativi di C++, gli array, i contenitori STL e qualsiasi tipo che supporti l'operatore <<.

source: This printer knows how to print built-in C++ types, native arrays, STL containers, and any type that supports the `<<` operator.
it_it: Questa stampante sa lavorare con i tipi nativi di C++, gli array, i contenitori STL e qualsiasi tipo che supporti l'operatore `<<`.

source: This recipe shows you how you can do it.
it_it: Questa ricetta mostra come lo si può fare.

source: This requirement must be satisfied no matter how a matcher is defined (e.g., if it is one of the standard matchers, or a custom matcher).
it_it: Questo requisito deve essere soddisfatto indipendentemente da come viene definito un matcher (ad esempio, se è uno dei matcher standard o un matcher personalizzato).
